CREATE TABLE user (
    userId BIGINT AUTO_INCREMENT PRIMARY KEY,
    loginId VARCHAR(255) NOT NULL UNIQUE,
    password VARCHAR(255) NOT NULL,
    name VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL,
    createdDate VARCHAR(255) NOT NULL
);

CREATE TABLE restaurant (
    restaurantId BIGINT AUTO_INCREMENT PRIMARY KEY,
    region VARCHAR(255) NOT NULL,
    name VARCHAR(255) NOT NULL,
    address VARCHAR(255) NOT NULL,
    phone VARCHAR(50),
    la DOUBLE NOT NULL,
    lo DOUBLE NOT NULL
);

CREATE TABLE review (
    reviewId BIGINT AUTO_INCREMENT PRIMARY KEY,
    userId BIGINT NOT NULL,
    restaurantId BIGINT NOT NULL,
    title VARCHAR(255) NOT NULL,
    content TEXT,
    rating DOUBLE NOT NULL,
    createdDate VARCHAR(255) NOT NULL,
    FOREIGN KEY (userId) REFERENCES user(userId) ON DELETE CASCADE,
    FOREIGN KEY (restaurantId) REFERENCES restaurant(restaurantId) ON DELETE CASCADE
);

INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('성남시', '두향', '경기도 성남시 분당구 불곡남로 5', '031-718-3344', 37.35892569, 127.1230194, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('성남시', '욕쟁이 장마담집', '경기도 성남시 수정구 수정로 460-3', '031-745-5700', 37.46154815, 127.1558057, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('성남시', '북촌생태찌개', '경기도 성남시 수정구 대왕판교로 907', '031-755-2707', 37.42123088, 127.1016185, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('성남시', '유명갈매기', '경기도 성남시 중원구 양현로 469', '031-752-2393', 37.41698328, 127.1344363, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '본수원갈비', '경기도 수원시 팔달구 중부대로223번길 41', '031-211-5952', 37.27802344, 127.0406386, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '신라갈비', '경기도 수원시 영통구 동수원로 538', '031-212-2354', 37.27377479, 127.0492142, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '송풍가든', '경기도 수원시 장안구 경수대로 1013', '031-252-4700', 37.3062283, 127.0006674, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '가보정', '경기도 수원시 팔달구 장다리로 282', '031-238-3883', 37.27422678, 127.0287166, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '대유평', '경기도 수원시 장안구 수일로 221', '031-227-2358', 37.30694492, 127.0147568, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '한국관', '경기도 수원시 팔달구 권선로741번길 16-8', '031-217-8889', 37.25818051, 127.0328989, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '서윤한정식', '경기도 수원시 영통구 덕영대로1499번길 28', '031-273-2345', 37.24689268, 127.0557112, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '남촌', '경기도 수원시 권선구 권광로 123', '031-239-0411', 37.25877435, 127.0303466, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '명가정', '경기도 수원시 권선구 탑동로57번길 29', '031-255-9916', 37.27306964, 126.9723723, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '우리낙지한마당', '경기도 수원시 팔달구 갓매산로 21', '031-226-2991', 37.26654531, 127.0062078, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '바나나테이블', '경기도 수원시 영통구 센트럴타운로 85', '031-205-0008', 37.29156405, 127.0504732, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('수원시', '연포갈비', '경기도 수원시 팔달구 정조로906번길 56-5', '031-255-1337', 37.28760009, 127.0167087, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('시흥시', '도토리마을묵집', '경기도 시흥시 동서로857번길 28-22', '031-485-9797', 37.38595299, 126.8401627, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('시흥시', '우강', '경기도 시흥시 옥구천서로 313', '031-433-0592', 37.35130478, 126.7229956, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '상록한정식', '경기도 안산시 상록구 해안로 705', '031-500-4455', 37.29164169, 126.8304612, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '광양참숯불구이', '경기도 안산시 단원구 광덕동로 101', '031-419-9233', 37.31360277, 126.8326702, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '이천영양돌솥밥', '경기도 안산시 상록구 항가울로 7', '031-408-2008', 37.28252226, 126.8470568, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '복요리전문점복청', '경기도 안산시 단원구 원고잔로 15', '031-410-3588', 37.31890039, 126.8274543, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '여울쌈밥', '경기도 안산시 단원구 꽃우물1길 16-5', '031-316-3838', 37.35848524, 126.8220989, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안산시', '오양순추어탕', '경기도 안산시 상록구 안산천동로 256', '031-401-1778', 37.33604577, 126.8502513, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안성시', '대림쌈밥', '경기도 안성시 공도읍 산책길 15', '031-651-3199', 37.01499591, 127.2034579, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안양시', '허서방추어탕메기매운탕', '경기도 안양시 만안구 예술공원로 118', '031-473-3040', 37.41792411, 126.9191133, '');
INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES ('안양시', '명가원설농탕', '경기도 안양시 동안구 관악대로 249', '031-384-5335', 37.40231816, 126.9504858, ''); 

INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('양주시', '봉암식당', '경기도 양주시 은현면 봉암길 17', '031-863-5064', 37.90763724, 127.0065728, ''),
('의정부시', '핏제리아 루카', '경기도 의정부시 송현로82번길 17', '031-851-3589', 37.74557881, 127.0904426, ''),
('파주시', '교하정', '경기도 파주시 교하로 1290', '031-942-7788', 37.74877792, 126.7369971, ''),
('파주시', '유일곰탕', '경기도 파주시 월롱면 다락고개길 119', '031-944-3691', 37.79536181, 126.7910941, ''),
('과천시', '해원복집', '경기도 과천시 별양상가로 2', '02-504-1626', 37.42775142, 126.9920513, ''),
('광주시', '수와연', '경기도 광주시 남종면 산수로 1680', '031-768-6446', 37.4988496, 127.3025715, ''),
('광주시', '고향매운탕', '경기도 광주시 남종면 산수로 1686', '031-767-9693', 37.49929153, 127.3027287, ''),
('김포시', '풀잎속의생명', '경기도 김포시 사우로 3-12', '031-997-6003', 37.62192276, 126.7226239, ''),
('남양주시', '더 늘봄', '경기도 남양주시 진접읍 금강로 1845', '031-572-4447', 37.74931632, 127.2074651, ''),
('남양주시', '맷돌36 숯불갈비', '경기도 남양주시 화도읍 맷돌로 36', '031-593-1511', 37.65807852, 127.2948607, ''),
('동두천시', '대호숯불갈비', '경기도 동두천시 중앙로265번길 19', '031-868-0092', 37.90524384, 127.0526923, ''),
('부천시', '우소보소 수련', '경기도 부천시 옥산로 104', '032-329-9100', 37.50303413, 126.7805625, ''),
('부천시', '작동오리불고기', '경기도 부천시 역곡로344번길 16', '032-681-5292', 37.51474261, 126.8138874, ''),
('성남시', '고암남원추어탕', '경기도 성남시 수정구 산성대로 597', '031-742-5666', 37.46307296, 127.1689498, ''),
('양주시', '동강어탕', '경기도 양주시 부흥로1398번길 71', '031-821-0079', 37.78111567, 127.0295141, ''),
('양주시', '나들이', '경기도 양주시 송랑로89번길 8', '031-848-4760', 37.79349646, 127.0888607, ''),
('양주시', '산하식당', '경기도 양주시 백석읍 기산로 410', '031-871-9369', 37.77580025, 126.9356284, ''),
('양주시', '황우촌', '경기도 양주시 백석읍 호명로 103-92', '031-826-6692', 37.78492426, 126.9937618, ''),
('양평군', '중미산막국수', '경기도 양평군 옥천면 마유산로 586', '031-773-1834', 37.53522682, 127.4671755, ''),
('양평군', '길조', '경기도 양평군 강상면 독배길 32-25', '031-774-7020', 37.49360338, 127.4734269, ''),
('여주시', '여주본가', '경기도 여주시 가남읍 가남로 270-3', '031-883-1277', 37.21457228, 127.5802138, ''),
('여주시', '강계봉진막국수', '경기도 여주시 대신면 천서리길 26', '031-882-8300', 37.40319738, 127.5489582, ''),
('수원시', '돌솥삼계탕', '경기도 수원시 권선구 수인로 273', '031-294-9600', 37.28178652, 126.9724694, '');


INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('여주시', '황제능이버섯 백숙', '경기도 여주시 여양로 428', '031-881-5285', 37.31859107, 127.6485946, ''),
('연천군', '대교여울목', '경기도 연천군 백학면 청정로46번길 25', '031-835-2528', 37.9897043, 126.9206353, ''),
('오산시', '콩마당', '경기도 오산시 독산성로 225', '031-372-3334', 37.17741589, 127.0240804, ''),
('오산시', '예찬', '경기도 오산시 독산성로270번길 96-32', '031-375-2552', 37.1819471, 127.0370076, ''),
('용인시', '주식회사시골농장가든', '경기도 용인시 처인구 양지면 한터로 690', '031-339-6600', 37.26086243, 127.2799287, ''),
('용인시', '옛터', '경기도 용인시 처인구 모현읍 능원로132번길 9', '031-339-6630', 37.32747395, 127.1737785, ''),
('용인시', '청룡', '경기도 용인시 처인구 원삼면 보개원삼로 1624', '031-334-9258', 37.13821673, 127.3114504, ''),
('용인시', '양대화', '경기도 용인시 수지구 죽전로 232', '031-889-2233', 37.3303507, 127.1283772, ''),
('용인시', '대덕골보쌈칼국수', '경기도 용인시 처인구 금령로71번길 16', '031-335-0201', 37.23642217, 127.2039908, ''),
('용인시', '장수촌', '경기도 용인시 수지구 성복2로 412', '031-266-1117', 37.32310245, 127.0454434, ''),
('의왕시', '정성담', '경기도 의왕시 고산로 1', '031-458-2300', 37.35198052, 126.9711657, ''),
('의정부시', '고산떡갈비', '경기도 의정부시 평화로562번길 13', '031-842-3006', 37.74230433, 127.0477953, ''),
('의정부시', '평양초계탕 막국수', '경기도 의정부시 둔야로33번길 34', '031-874-6526', 37.73903844, 127.0377026, ''),
('의정부시', '장수민촌', '경기도 의정부시 승지로4번길 15', '031-853-2578', 37.73804804, 127.0890881, '');


INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('이천시', '증포설렁탕', '경기도 이천시 증신로 166', '031-635-7877', 37.29030741, 127.4513294, ''),
('이천시', '안옥화 음식갤러리', '경기도 이천시 신둔면 석동로 51-12', '031-631-8375', 37.32227412, 127.4233289, ''),
('파주시', '초계탕,춘천막국수', '경기도 파주시 법원읍 초리골길 110', '031-958-5250', 37.85110034, 126.8896218, ''),
('파주시', '문산밤나무골', '경기도 파주시 파주읍 통일로 1604-144', '031-952-5240', 37.85256061, 126.7944797, ''),
('파주시', '오백년누룩지백숙', '경기도 파주시 탄현면 새오리로 94', '031-8071-6500', 37.79261783, 126.6858912, ''),
('파주시', '물빛하늘정원', '경기도 파주시 탄현면 새오리로 209-23', '031-948-8535', 37.80094081, 126.6877763, ''),
('평택시', '고려정', '경기도 평택시 평택3로 75', '031-657-8484', 36.9958963, 127.0943744, ''),
('평택시', '㈜푸른소 경복궁', '경기도 평택시 조개터로26번길 64', '031-655-0567', 36.98862248, 127.1053019, ''),
('포천시', '갈비장터', '경기도 포천시 소흘읍 솔모루로58번길 4', '031-536-3392', 37.82723607, 127.1453759, ''),
('포천시', '참나무쟁이', '경기도 포천시 내촌면 금강로 2458', '031-531-7970', 37.79457063, 127.2336151, ''),
('포천시', '명지원', '경기도 포천시 일동면 화동로 1258', '031-536-9919', 37.97202868, 127.3310272, ''),
('포천시', '동이손만두', '경기도 포천시 소흘읍 광릉수목원로 700-5', '031-541-6870', 37.77371845, 127.1584401, ''),
('포천시', '대복 복전문점', '경기도 포천시 호국로964번길 12', '031-535-0303', 37.85024134, 127.1651576, ''),
('포천시', '대대손손묵집', '경기도 포천시 소흘읍 죽엽산로447번길 11-3', '031-542-6898', 37.79442726, 127.166659, ''),
('포천시', '허브아일랜드 아테네홀', '경기도 포천시 신북면 청신로947번길 35', '031-353-1174', 37.96592242, 127.1317088, ''),
('포천시', '상황버섯향촌', '경기도 포천시 군내면 포천로 1540', '031-535-0005', 37.89645635, 127.2076571, '');


INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('수원시', '장터설렁탕', '경기도 수원시 권선구 수인로 257', '031-293-1006', 37.28089985, 126.9737503, ''),
('수원시', '거진포생태도루묵', '경기도 수원시 팔달구 중부대로128번길 49', '031-222-2381', 37.27596033, 127.029439, ''),
('수원시', '기와집', '경기도 수원시 권선구 서수원로594번길 251', '031-298-8882', 37.28558056, 126.9583189, ''),
('수원시', '추미정남원추어탕', '경기도 수원시 장안구 파장천로 123', '031-271-6400', 37.31493907, 127.0014675, ''),
('시흥시', '소꼼닭', '경기도 시흥시 서촌상가3길 15-6', '', 37.34732289, 126.7329946, ''),
('안산시', '해미청', '경기도 안산시 상록구 각골로 47', '031-438-7789', 37.29377283, 126.8722885, ''),
('안산시', '궁중삼계탕', '경기도 안산시 상록구 석호공원로 69', '031-502-9090', 37.30168981, 126.8510886, ''),
('안성시', '안성맞춤한우촌', '경기도 안성시 삼죽면 신미1길 126', '031-673-5550', 37.03674194, 127.3714092, ''),
('안양시', '화진가든', '경기도 안양시 만안구 안양로 468', '031-472-9292', 37.41180025, 126.9111037, ''),
('안양시', '해조', '경기도 안양시 동안구 관평로186번길 23', '031-385-1407', 37.39403952, 126.9613579, ''),
('여주시', '삼구농원', '경기도 여주시 세종로517번길 55-18', '031-884-3911', 37.25683943, 127.653187, ''),
('오산시', '세마오리농원', '경기도 오산시 양산로 186', '031-375-5299', 37.18680461, 127.012034, ''),
('오산시', '어부나라생선구이', '경기도 오산시 지곶길 49', '031-373-2186', 37.17859824, 127.024456, ''),
('용인시', '㈜한국관', '경기도 용인시 기흥구 기흥단지로 8', '031-275-6100', 37.22248075, 127.1033877, ''),
('용인시', '주식회사 청와정', '경기도 용인시 수지구 수지로342번길 7', '031-896-9876', 37.32806393, 127.0962076, '');


INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('의왕시', '민속두부마을', '경기도 의왕시 오봉산길 17', '031-429-5429', 37.34978762, 126.9626224, '한식'),
('의정부시', '송산주막한우생고기전문점', '경기도 의정부시 청사로6번길 7-14', '031-853-1010', 37.74975775, 127.071792, '한식'),
('하남시', '지호 한방 삼계탕', '경기도 하남시 하남대로 995', '031-795-9996', 37.54762922, 127.1886477, '한식'),
('하남시', '한채당', '경기도 하남시 미사동로 38', '031-792-8880', 37.57066517, 127.2015746, '한식'),
('하남시', '하남미소 명품한우', '경기도 하남시 대청로 27', '031-699-0002', 37.54101722, 127.2152084, '한식'),
('화성시', '홍천덤바우록계탕', '경기도 화성시 남양읍 역골중앙로41번길 42', '031-366-7880', 37.20636442, 126.8278232, '한식'),
('화성시', '소담뜰', '경기도 화성시 향남읍 배터길 14', '031-8059-7667', 37.13273371, 126.9063607, '한식'),
('고양시', '청정바지락칼국수', '경기도 고양시 일산동구 일산로463번길 7', '031-912-7676', 37.6737966, 126.7754243, '한식'),
('고양시', '야구장농원', '경기도 고양시 일산동구 견달산로 351', '031-964-2884', 37.69715209, 126.819685, '한식'),
('고양시', '정통중화요리 남궁', '경기도 고양시 일산서구 일산로 682', '031-911-3702', 37.68211454, 126.7535463, '한식'),
('고양시', '쥐눈이 콩마을', '경기도 고양시 덕양구 신촌길 81-15', '031-965-5990', 37.66995281, 126.8554586, '한식'),
('과천시', '경마장 오리집', '경기도 과천시 궁말로 20-4', '02-502-7500', 37.44107918, 127.0104554, '한식'),
('광주시', '쇠뫼기', '경기도 광주시 퇴촌면 정영로 580-3', '031-767-9852', 37.47786486, 127.3511585, '한식'),
('광주시', '한마당', '경기도 광주시 남한산성면 남한산성로792번길 17-1', '031-743-6602', 37.47718845, 127.1821089, '한식'),
('광주시', '맛있는 발효밥상궁뜰', '경기도 광주시 도척면 궁평하천길 38', '031-766-0987', 37.33983407, 127.3356487, '한식');


INSERT INTO restaurant (region, name, address, phone, la, lo, category) VALUES 
('광주시', '능골한우가', '경기도 광주시 오포로 147', '031-797-0255', 37.34565862, 127.1817498, '한식'),
('김포시', '나룻터숯불장어구이', '경기도 김포시 월곶면 김포대로3023번길 96', '031-981-1071', 37.73123433, 126.5260318, '한식'),
('김포시', '남강메기매운탕', '경기도 김포시 김포대로 1535', '031-985-7764', 37.65989395, 126.6656657, '한식'),
('남양주시', '광릉돌솥밥', '경기도 남양주시 진접읍 금강로1845번길 1', '031-527-3334', 37.7496438, 127.2086784, '한식'),
('남양주시', '남양주축협한우명가', '경기도 남양주시 화도읍 창현로 47-1', '031-511-8892', 37.64630757, 127.3058546, '한식'),
('남양주시', '(주)광릉불고기', '경기도 남양주시 진접읍 광릉내로82번길 40-1', '031-527-6631', 37.74500019, 127.2079588, '한식'),
('동두천시', '생연칼국수', '경기도 동두천시 생연로 124', '031-865-2011', 37.90353541, 127.0513832, '한식'),
('동두천시', '그집순대국', '경기도 동두천시 장고갯로 127', '031-863-2254', 37.9064955, 127.0644014, '한식'),
('동두천시', '동동갈비', '경기도 동두천시 어수로101번길 13', '031-864-3093', 37.90295879, 127.0538095, '한식'),
('동두천시', '아리랑갈비', '경기도 동두천시 평화로2261번길 36', '031-868-2435', 37.89080184, 127.0566124, '한식'),
('부천시', '참맛진숯불갈비', '경기도 부천시 석천로177번길 16', '032-325-6464', 37.50352368, 126.7620258, '한식'),
('부천시', '조박사아구까치복', '경기도 부천시 삼작로256번길 9', '032-677-2100', 37.51982042, 126.7900315, '한식'),
('부천시', '황해도', '경기도 부천시 원종로51번길 64', '032-672-5524', 37.52693602, 126.8058649, '한식'),
('부천시', '명가추어탕', '경기도 부천시 원종로86번길 7', '032-678-1314', 37.52380397, 126.8097303, '한식'),
('부천시', '송도 숯불장어', '경기도 부천시 길주로 81', '032-221-0505', 37.50633295, 126.7515325, '한식');